In [1]:
import pandas as pd
ph=pd.DataFrame({'name':['a','b','a','c','d','e','b','a','b'],'s1':[1,2,9,3,4,9,7,8,9],'s2':[2,5,4,3,9,1,2,3,10]})

In [2]:
var=ph.groupby('name')

In [7]:
for x,y in var:
    print(x)
    print(y)
    print()

a
  name  s1  s2
0    a   1   2
2    a   9   4
7    a   8   3

b
  name  s1  s2
1    b   2   5
6    b   7   2
8    b   9  10

c
  name  s1  s2
3    c   3   3

d
  name  s1  s2
4    d   4   9

e
  name  s1  s2
5    e   9   1

In [8]:
var.get_group('a')

  name  s1  s2
0    a   1   2
2    a   9   4
7    a   8   3

In [9]:
var.min()

      s1  s2
name
a      1   2
b      2   2
c      3   3
d      4   9
e      9   1

In [10]:
var.max()

      s1  s2
name
a      9   4
b      9  10
c      3   3
d      4   9
e      9   1